# Common Errors in SQL

  In this Notebook we will visit some common errors made in sql. Relational Database Management System used here is sqlite. First few steps involves creating tables to set up the environment and creating neccesary tables.__Though these parts are essential, our focus will lie on the later parts of the notebook.__

## Setting up the environment

  First we install ipython-sql. This requires pandas,sqlalchemy to be installed. Attribute '--user' is required if you have installed python in your local user account.

In [1]:
!pip install ipython-sql --user

Requirement already satisfied: ipython-sql in /home/viswanathan/.local/lib/python3.6/site-packages (0.3.9)
Requirement already satisfied: sqlparse in /home/viswanathan/.local/lib/python3.6/site-packages (from ipython-sql) (0.3.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in /home/viswanathan/.local/lib/python3.6/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in /home/viswanathan/.local/lib/python3.6/site-packages (from ipython-sql) (1.3.8)
Requirement already satisfied: prettytable in /home/viswanathan/.local/lib/python3.6/site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: six in /home/viswanathan/.local/lib/python3.6/site-packages (from ipython-sql) (1.12.0)
Requirement already satisfied: ipython>=1.0 in /home/viswanathan/.local/lib/python3.6/site-packages (from ipython-sql) (7.6.1)
Requirement already satisfied: prompt-toolkit<2.1.0,>=2.0.0 in /home/viswanathan/.local/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (2.0.9)
Requirement already satisfied: decorator in /home/viswanathan/.local/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (4.4.0)
Requirement already satisfied: traitlets>=4.2 in /home/viswanathan/.local/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (4.3.2)
Requirement already satisfied: backcall in /home/viswanathan/.local/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: pickleshare in /home/viswanathan/.local/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: jedi>=0.10 in /home/viswanathan/.local/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (0.14.0)
Requirement already satisfied: pexpect; sys_platform != "win32" in /home/viswanathan/.local/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (4.7.0)
Requirement already satisfied: setuptools>=18.5 in /home/viswanathan/.local/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (40.8.0)
Requirement already satisfied: pygments in /home/viswanathan/.local/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (2.4.2)
Requirement already satisfied: wcwidth in /home/viswanathan/.local/lib/python3.6/site-packages (from prompt-toolkit<2.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.1.7)
Requirement already satisfied: parso>=0.3.0 in /home/viswanathan/.local/lib/python3.6/site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.5.0)
Requirement already satisfied: ptyprocess>=0.5 in /home/viswanathan/.local/lib/python3.6/site-packages (from pexpect; sys_platform != "win32"->ipython>=1.0->ipython-sql) (0.6.0)

In [2]:
#loading the installed sql
%load_ext sql

In [3]:
%sql sqlite://
    #if you get 'Connected: @None',then connection would be established

'Connected: @None'

## Creating Tables
 In this session we will create tables required. Sole purpose of including this session in the notebook is to have an idea how a table would be created in sqlite(similar to postgresql). Incase you know how to create a table or you have come to see the later part of the notebook, please execute the cells and move to the next session.

In [4]:
%%sql 
CREATE TABLE Physics(
Name varchar(255),
City varchar(255),
Mark int);

 * sqlite://
Done.

[]

In [5]:
%%sql
INSERT INTO Physics VALUES('Arun','Trichy',60);
INSERT INTO Physics VALUES('Arun','Coimbatore',95);
INSERT INTO Physics VALUES('Bala','Madurai',80);
INSERT INTO Physics VALUES('Chandru','Trichy',70);
INSERT INTO Physics VALUES('Dharma','Thanjavur',92);
INSERT INTO Physics VALUES('Dharma','Madurai',68);
INSERT INTO Physics VALUES('Elango','Chennai',77);
INSERT INTO Physics VALUES('Gokul','Tirunelveli',80);
INSERT INTO Physics VALUES('Gokul','Tirunelveli',56);
INSERT INTO Physics VALUES('Rahul','Trichy',65);
INSERT INTO Physics VALUES('Ram','Coimbatore',58);
INSERT INTO Physics VALUES('Raja','Salem',96);
INSERT INTO Physics VALUES('Sashi','Madurai',90);
INSERT INTO Physics VALUES('Siva','Thanjavur',69);
INSERT INTO Physics VALUES('Sivaram','Salem',90);
INSERT INTO Physics VALUES('Viswa','Trichy',89);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [6]:
%%sql 
CREATE TABLE Chemistry(
Name varchar(255),
City varchar(255),
Mark int);

 * sqlite://
Done.

[]

In [7]:
%%sql
INSERT INTO Chemistry VALUES('Arun','Trichy',90);
INSERT INTO Chemistry VALUES('Arun','Coimbatore',85);
INSERT INTO Chemistry VALUES('Bala','Madurai',90);
INSERT INTO Chemistry VALUES('Chandru','Trichy',85);
INSERT INTO Chemistry VALUES('Dharma','Thanjavur',82);
INSERT INTO Chemistry VALUES('Dharma','Madurai',60);
INSERT INTO Chemistry VALUES('Elango','Chennai',73);
INSERT INTO Chemistry VALUES('Gokul','Tirunelveli',60);
INSERT INTO Chemistry VALUES('Gokul','Tirunelveli',66);
INSERT INTO Chemistry VALUES('Harish','Salem',79);
INSERT INTO Chemistry VALUES('Rahul','Trichy',75);
INSERT INTO Chemistry VALUES('Ram','Coimbatore',78);
INSERT INTO Chemistry VALUES('Raja','Salem',86);
INSERT INTO Chemistry VALUES('Sashi','Madurai',80);
INSERT INTO Chemistry VALUES('Siva','Thanjavur',79);
INSERT INTO Chemistry VALUES('Sivaram','Salem',89);
INSERT INTO Chemistry VALUES('Viswa','Trichy',99);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [8]:
%%sql 
CREATE TABLE Mathematics(
Name varchar(255),
City varchar(255),
Mark int);

 * sqlite://
Done.

[]

In [9]:
%%sql
INSERT INTO Mathematics VALUES('Arun','Trichy',80);
INSERT INTO Mathematics VALUES('Arun','Coimbatore',90);
INSERT INTO Mathematics VALUES('Bala','Madurai',80);
INSERT INTO Mathematics VALUES('Bhuvanesh','Vellore',60);
INSERT INTO Mathematics VALUES('Chandru','Trichy',60);
INSERT INTO Mathematics VALUES('Dharma','Thanjavur',82);
INSERT INTO Mathematics VALUES('Dharma','Madurai',64);
INSERT INTO Mathematics VALUES('Elango','Chennai',70);
INSERT INTO Mathematics VALUES('Gokul','Tirunelveli',90);
INSERT INTO Mathematics VALUES('Gokul','Tirunelveli',76);
INSERT INTO Mathematics VALUES('Rahul','Trichy',55);
INSERT INTO Mathematics VALUES('Ram','Coimbatore',78);
INSERT INTO Mathematics VALUES('Raja','Salem',86);
INSERT INTO Mathematics VALUES('Sashi','Madurai',80);
INSERT INTO Mathematics VALUES('Siva','Thanjavur',79);
INSERT INTO Mathematics VALUES('Sivaram','Salem',80);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

References:
To know more on the SQL-Jupternotebook interface read the following article:
https://www.datacamp.com/community/tutorials/sql-interface-within-jupyterlab

## Some common Errors

   There may be lot of possible combinations of errors committed by both beginners and experts in SQL. Here are the discussion on some of these errors.
   
   
   1) Importance of primary key.
   
   2) Full Outer Join in Sqlite
   
   3) Aggregating Non-Aggreagating function
   
   4) When to use join and when not to use join
   
   5) IN vs JOIN
   
   6) Dealing with NULL

## 1) Importance of primary key

In [10]:

%%sql
SELECT * 
FROM Physics

 * sqlite://
Done.

[('Arun', 'Trichy', 60),
 ('Arun', 'Coimbatore', 95),
 ('Bala', 'Madurai', 80),
 ('Chandru', 'Trichy', 70),
 ('Dharma', 'Thanjavur', 92),
 ('Dharma', 'Madurai', 68),
 ('Elango', 'Chennai', 77),
 ('Gokul', 'Tirunelveli', 80),
 ('Gokul', 'Tirunelveli', 56),
 ('Rahul', 'Trichy', 65),
 ('Ram', 'Coimbatore', 58),
 ('Raja', 'Salem', 96),
 ('Sashi', 'Madurai', 90),
 ('Siva', 'Thanjavur', 69),
 ('Sivaram', 'Salem', 90),
 ('Viswa', 'Trichy', 89)]

   In this Table there are two students with the same name 'Arun', So we cannot identify a student with his name alone uniquely. We can choose combination of 'Name' and 'City' in this case. Two students with name Arun can thus be differentiated.

In [11]:
%%sql
SELECT * 
FROM Physics
WHERE Name='Arun'

 * sqlite://
Done.

[('Arun', 'Trichy', 60), ('Arun', 'Coimbatore', 95)]

In [12]:
%%sql
SELECT * 
FROM Physics
WHERE Name='Arun' and City='Trichy'

 * sqlite://
Done.

[('Arun', 'Trichy', 60)]

But still! There are two 'Gokul' from the city 'Tirunelveli'. In this case how can you identify which Gokul it is?

In [13]:
%%sql
SELECT * 
FROM Physics
WHERE Name='Gokul' and City='Tirunelveli'

 * sqlite://
Done.

[('Gokul', 'Tirunelveli', 80), ('Gokul', 'Tirunelveli', 56)]

Can we have combination of Name,City and Mark? We have two problems in this case:

1) If we know the mark of Gokul, whats the point of querying? 

2) What if two students named Gokul from Tirunelveli had same mark in Physics? How do we know whether it is a duplicate records or there are two students of similar records? 

[Though there are less probability of such cases, but still in a database containing millions of records. There are a lot of possibilities]

Also if we want to join the marks students got in Physics Chemistry and Mathematics, on which basics can we join?

This is where unique identification of each record, is important in relational database management system.

### Updated Table

In [14]:
from sqlalchemy import create_engine
engine=create_engine("sqlite:///Marks.db",echo=True)

In [15]:
conn=engine.connect()
P=conn.execute("SELECT * FROM Physics")
for p in P.fetchall():
    print(p)

2019-10-11 13:00:12,887 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2019-10-11 13:00:12,889 INFO sqlalchemy.engine.base.Engine ()
2019-10-11 13:00:12,892 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2019-10-11 13:00:12,896 INFO sqlalchemy.engine.base.Engine ()
2019-10-11 13:00:12,899 INFO sqlalchemy.engine.base.Engine SELECT * FROM Physics
2019-10-11 13:00:12,902 INFO sqlalchemy.engine.base.Engine ()
(2, 'Arun', 'Trichy', 60)
(1, 'Arun', 'Coimbatore', 95)
(3, 'Bala', 'Madurai', 80)
(5, 'Chandru', 'Trichy', 70)
(7, 'Dharma', 'Thanjavur', 92)
(6, 'Dharma', 'Madurai', 68)
(8, 'Elango', 'Chennai', 77)
(9, 'Gokul', 'Tirunelveli', 80)
(10, 'Gokul', 'Tirunelveli', 56)
(12, 'Rahul', 'Trichy', 65)
(13, 'Ram', 'Coimbatore', 58)
(14, 'Raja', 'Salem', 96)
(15, 'Sashi', 'Madurai', 90)
(16, 'Siva', 'Thanjavur', 69)
(17, 'Sivaram', 'Salem', 90)
(18, 'Viswa', 'Trichy', 89)

  Here we see updated table with primary key with the name of 'Student_Id'. The Database 'Marks.db' was build already with three tables Physics,Chemistry and Mathematics each containing Student_Id as primary key. 
  The database and SQL Comment for creating the database are attached in the repository as 'Marks.db' and 'Marks.sql'

In [16]:
Result=conn.execute("SELECT * \
                    FROM Physics\
                    WHERE Student_Id = '9'")
print(Result.fetchall())
conn.close()

2019-10-11 13:00:12,964 INFO sqlalchemy.engine.base.Engine SELECT * FROM Physics WHERE Student_Id = '9'
2019-10-11 13:00:12,969 INFO sqlalchemy.engine.base.Engine ()
[(9, 'Gokul', 'Tirunelveli', 80)]

We have chosen the correct Gokul since we know his Student_Id. Similarly if we know a student's student id,
we can easily query and find his details.

This unique number also helps in joining the table with other tables.

For More details on primary key refer:
https://www.sqlitetutorial.net/sqlite-primary-key/

# 2) Full Outer join in sqlite

FULL OUTER JOIN combine the records of two tables based on 'on' clause and also returns all the other records in both the tables.

SQLITE do not have an option for full outer join. This is a major problem a beginner would face in SQL.
We try here to join Physics and Mathematics table here by an outer full join.

In [26]:
conn=engine.connect()
Result=conn.execute("SELECT * \
                    FROM Physics as P FULL OUTER JOIN \
                    Mathematics as M \
                    ON P.Student_Id=M.Student_ID")
for r in Result.fetchall():
    print(r)
conn.close()

2019-10-11 13:54:19,131 INFO sqlalchemy.engine.base.Engine SELECT *                     FROM Physics as P FULL OUTER JOIN                     Mathematics as M                     ON P.Student_Id=M.Student_ID
2019-10-11 13:54:19,135 INFO sqlalchemy.engine.base.Engine ()
2019-10-11 13:54:19,138 INFO sqlalchemy.engine.base.Engine ROLLBACK

OperationalError: (sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported
[SQL: SELECT *                     FROM Physics as P FULL OUTER JOIN                     Mathematics as M                     ON P.Student_Id=M.Student_ID]
(Background on this error at: http://sqlalche.me/e/e3q8)

Now we get an error "(sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported".
Sqlite donot support RIGHT and FULL OUTER JOINs.
Solution is we can use a left join to combine Physics and Chemistry and another left join to combine Chemistry and Physics and union both of them.

In [28]:
conn=engine.connect()
Result=conn.execute("SELECT * \
                    FROM Physics as P LEFT JOIN Mathematics as M ON P.Student_Id=M.Student_ID UNION \
                    SELECT * \
                    FROM Mathematics as M LEFT JOIN Physics as P ON P.Student_Id=M.Student_ID ")
for r in Result.fetchall():
    print(r)
conn.close()

2019-10-11 14:11:36,687 INFO sqlalchemy.engine.base.Engine SELECT *                     FROM Physics as P LEFT JOIN Mathematics as M ON P.Student_Id=M.Student_ID UNION                     SELECT *                     FROM Mathematics as M LEFT JOIN Physics as P ON P.Student_Id=M.Student_ID
2019-10-11 14:11:36,690 INFO sqlalchemy.engine.base.Engine ()
(1, 'Arun', 'Coimbatore', 90, 1, 'Arun', 'Coimbatore', 95)
(1, 'Arun', 'Coimbatore', 95, 1, 'Arun', 'Coimbatore', 90)
(2, 'Arun', 'Trichy', 60, 2, 'Arun', 'Trichy', 80)
(2, 'Arun', 'Trichy', 80, 2, 'Arun', 'Trichy', 60)
(3, 'Bala', 'Madurai', 80, 3, 'Bala', 'Madurai', 80)
(4, 'Bhuvanesh', 'Vellore', 60, None, None, None, None)
(5, 'Chandru', 'Trichy', 60, 5, 'Chandru', 'Trichy', 70)
(5, 'Chandru', 'Trichy', 70, 5, 'Chandru', 'Trichy', 60)
(6, 'Dharma', 'Madurai', 64, 6, 'Dharma', 'Madurai', 68)
(6, 'Dharma', 'Madurai', 68, 6, 'Dharma', 'Madurai', 64)
(7, 'Dharma', 'Thanjavur', 82, 7, 'Dharma', 'Thanjavur', 92)
(7, 'Dharma', 'Thanjavur', 92, 7, 'Dharma', 'Thanjavur', 82)
(8, 'Elango', 'Chennai', 70, 8, 'Elango', 'Chennai', 77)
(8, 'Elango', 'Chennai', 77, 8, 'Elango', 'Chennai', 70)
(9, 'Gokul', 'Tirunelveli', 80, 9, 'Gokul', 'Tirunelveli', 90)
(9, 'Gokul', 'Tirunelveli', 90, 9, 'Gokul', 'Tirunelveli', 80)
(10, 'Gokul', 'Tirunelveli', 56, 10, 'Gokul', 'Tirunelveli', 76)
(10, 'Gokul', 'Tirunelveli', 76, 10, 'Gokul', 'Tirunelveli', 56)
(12, 'Rahul', 'Trichy', 55, 12, 'Rahul', 'Trichy', 65)
(12, 'Rahul', 'Trichy', 65, 12, 'Rahul', 'Trichy', 55)
(13, 'Ram', 'Coimbatore', 58, 13, 'Ram', 'Coimbatore', 78)
(13, 'Ram', 'Coimbatore', 78, 13, 'Ram', 'Coimbatore', 58)
(14, 'Raja', 'Salem', 86, 14, 'Raja', 'Salem', 96)
(14, 'Raja', 'Salem', 96, 14, 'Raja', 'Salem', 86)
(15, 'Sashi', 'Madurai', 80, 15, 'Sashi', 'Madurai', 90)
(15, 'Sashi', 'Madurai', 90, 15, 'Sashi', 'Madurai', 80)
(16, 'Siva', 'Thanjavur', 69, 16, 'Siva', 'Thanjavur', 79)
(16, 'Siva', 'Thanjavur', 79, 16, 'Siva', 'Thanjavur', 69)
(17, 'Sivaram', 'Salem', 80, 17, 'Sivaram', 'Salem', 90)
(17, 'Sivaram', 'Salem', 90, 17, 'Sivaram', 'Salem', 80)
(18, 'Viswa', 'Trichy', 89, None, None, None, None)

Here We have a full outer join! Bhuvanesh did not attend Physics test and Viswa didnot attend Chemistry test.Therefore their details are missing in the respective tables. We find 'None' values at places where details are missing.

Selecting specific columns we get the following

In [25]:
conn=engine.connect()
Result=conn.execute("SELECT P.Student_Id,P.Name,P.City,P.Mark as Physics_mark,M.Mark as Mathematics_mark \
                    FROM Physics as P LEFT JOIN Mathematics as M ON P.Student_Id=M.Student_ID UNION \
                    SELECT M.Student_Id,M.Name,M.City,P.Mark as Physics_mark,M.Mark as Mathematics_mark \
                    FROM Mathematics as M LEFT JOIN Physics as P ON P.Student_Id=M.Student_ID ")
for r in Result.fetchall():
    print(r)
conn.close()

2019-10-11 13:53:34,850 INFO sqlalchemy.engine.base.Engine SELECT P.Student_Id,P.Name,P.City,P.Mark as Physics_mark,M.Mark as Mathematics_mark                     FROM Physics as P LEFT JOIN Mathematics as M ON P.Student_Id=M.Student_ID UNION                     SELECT M.Student_Id,M.Name,M.City,P.Mark as Physics_mark,M.Mark as Mathematics_mark                     FROM Mathematics as M LEFT JOIN Physics as P ON P.Student_Id=M.Student_ID
2019-10-11 13:53:34,855 INFO sqlalchemy.engine.base.Engine ()
(1, 'Arun', 'Coimbatore', 95, 90)
(2, 'Arun', 'Trichy', 60, 80)
(3, 'Bala', 'Madurai', 80, 80)
(4, 'Bhuvanesh', 'Vellore', None, 60)
(5, 'Chandru', 'Trichy', 70, 60)
(6, 'Dharma', 'Madurai', 68, 64)
(7, 'Dharma', 'Thanjavur', 92, 82)
(8, 'Elango', 'Chennai', 77, 70)
(9, 'Gokul', 'Tirunelveli', 80, 90)
(10, 'Gokul', 'Tirunelveli', 56, 76)
(12, 'Rahul', 'Trichy', 65, 55)
(13, 'Ram', 'Coimbatore', 58, 78)
(14, 'Raja', 'Salem', 96, 86)
(15, 'Sashi', 'Madurai', 90, 80)
(16, 'Siva', 'Thanjavur', 69, 79)
(17, 'Sivaram', 'Salem', 90, 80)
(18, 'Viswa', 'Trichy', 89, None)

 Here we have 17 students(Except 11) who have attended both the test. Note the Physics score of bhuvanesh and Mathematics score of Viswa. We sucessfully done the full outer join using sqlite!
   We can perform Right join by swaping the tables and performing a left join.